
welcome_message = '''Привет! Мы — dotNetDon Network 🚀

✅ Надежный сервис для защиты интернет-соединения  
🌍 Сохраняем приватность и безопасность в сети  
🔒 Без логов, без рекламы  
⚡️ Просто, быстро и всегда на связи

Перед использованием ознакомься с нашей 📜 политикой сервиса — и вперёд 👌
Жми 👉 «Подключиться»
'''

welcome_message_free = '''Привет! Мы — dotNetDon Network 🚀  

🔧 Сейчас сервис работает в тестовом режиме.  
Наша цель — проверить стабильность и собрать отзывы от пользователей.  

✅ Бесплатный доступ на время теста  
🌍 Защита соединения и удобство в использовании  
⚡️ Несколько серверов для надежной работы  

❗️Перед использованием обязательно прочитай 📜 «Политику сервиса» (в меню).  

Нам очень важна твоя обратная связь: что удобно, что мешает, что хотелось бы улучшить 🙌  

Жми 👉 «Подключиться» и помоги нам сделать сервис лучше!
'''


service_rules_message = '''📜 Политика использования сервиса dotNetDon Network

Мы предоставляем техническое решение для защиты интернет-соединения и обеспечения цифровой приватности.

❗️Важно:
— Мы не поощряем и не поддерживаем доступ к запрещённой информации.
— Использование сервиса для нарушения законов Российской Федерации строго запрещено.
— Пользователям запрещено использовать сервис для:
    - поиска или распространения экстремистских материалов,
    - доступа к ресурсам, заблокированным по решению суда,
    - любых действий, нарушающих законодательство РФ.

🧾 Приобретая доступ (ключ, подписку), вы соглашаетесь с данной политикой и подтверждаете, что используете сервис исключительно в рамках правового поля.

⚠️ Мы оставляем за собой право ограничить доступ при нарушении условий использования.

🔗 Ознакомиться с официальной позицией Роскомнадзора:
https://rkn.gov.ru/
https://rkn.gov.ru/docs/

Спасибо за понимание.

'''

partner_program_message = '''👥 Партнёрская программа

Зарабатывай, приглашая друзей! Делись своей уникальной ссылкой и получай бонусы за каждого друга, который оформит подписку.

🎁 За каждого друга ты получаешь:
— +7 дней VPN или
— 20% от его первой оплаты на твой баланс

💼 Статистика и выбор бонуса доступны в разделе "Партнёрка".

📌 Всё честно: если человек пришёл по твоей ссылке и купил — ты точно получишь бонус.
'''

about_us_message = '''🌐 Весь трафик идёт через современные сервера в Нидерландах, Москве и других локациях. 
Не собирается, не хранится и защищён сквозным шифрованием - спокойно вводи логины/пароли и отправляй личные файлы, они в безопасности

 Описание для отключения автоподписки на VPN:

✅️Проверить скорость интернета на своем устройстве ты сможешь после подключения VPN
📍 Твой постоянный IP-адрес - даёт снижение риска блокировки аккаунтов из-за частой смены IP
'''

ios_links = [
        'https://apps.apple.com/ru/app/streisand/id6450534064',
        'https://apps.apple.com/ru/app/happ-proxy-utility-plus/id6746188973',
        'https://apps.apple.com/us/app/foxray/id6448898396',
        'https://apps.apple.com/us/app/v2box-v2ray-client/id6446814690'
    ]

android_links = [
    'https://github.com/MatsuriDayo/NekoBoxForAndroid/releases',
    'https://play.google.com/store/apps/details?id=io.nekohasekai.sfa&hl=ru',
    'https://github.com/2dust/v2rayNG'
]

PLAN_PRICES = {
    "1m": 99,
    "3m": 279,
    "6m": 549,
    "12m": 999
}

PLAN_DURATIONS = {
    "1m": 1,
    "3m": 3,
    "6m": 6,
    "12m": 12
}