welcome_message_free = '''Привет! Мы — dotNetDon Network 🚀  

🔧 Cервис работает в тестовом режиме.  

❗️Перед использованием обязательно прочитай 📜 «Политику сервиса» (в меню).  

'''


service_rules_message = '''📜 Политика использования сервиса dotNetDon Network

Мы предоставляем техническое решение для защиты интернет-соединения и обеспечения цифровой приватности.

❗️Важно:
— Мы не поощряем и не поддерживаем доступ к запрещённой информации.
— Использование сервиса для нарушения законов Российской Федерации строго запрещено.
— Пользователям запрещено использовать сервис для:
    - поиска или распространения экстремистских материалов,
    - доступа к ресурсам, заблокированным по решению суда,
    - любых действий, нарушающих законодательство РФ.

🧾 Приобретая доступ (ключ, подписку), вы соглашаетесь с данной политикой и подтверждаете, что используете сервис исключительно в рамках правового поля.

⚠️ Мы оставляем за собой право ограничить доступ при нарушении условий использования.

🔗 Ознакомиться с официальной позицией Роскомнадзора:
https://rkn.gov.ru/
https://rkn.gov.ru/docs/

Спасибо за понимание.

'''

ios_links = [
        'https://apps.apple.com/ru/app/streisand/id6450534064',
        'https://apps.apple.com/ru/app/happ-proxy-utility-plus/id6746188973',
        'https://apps.apple.com/us/app/foxray/id6448898396',
        'https://apps.apple.com/us/app/v2box-v2ray-client/id6446814690'
    ]

android_links = [
    'https://github.com/MatsuriDayo/NekoBoxForAndroid/releases',
    'https://play.google.com/store/apps/details?id=io.nekohasekai.sfa&hl=ru',
    'https://github.com/2dust/v2rayNG'
]