
welcome_message = '''Привет! Мы — dotNetDon VPN 🚀

✅ Бесплатный VPN - мы в тестовом режиме!
🌍 Обход блокировок и DPI
🔒 Без логов, без рекламы
⚡️ Быстро, просто, работает всегда

Жми 👉 «Подключиться» и забудь про ограничения 👌
'''

partner_program_message = '''👥 Партнёрская программа

Зарабатывай, приглашая друзей! Делись своей уникальной ссылкой и получай бонусы за каждого друга, который оформит подписку.

🎁 За каждого друга ты получаешь:
— +7 дней VPN или
— 20% от его первой оплаты на твой баланс

💼 Статистика и выбор бонуса доступны в разделе "Партнёрка".

📌 Всё честно: если человек пришёл по твоей ссылке и купил — ты точно получишь бонус.
'''

about_us_message = '''🌐 Весь трафик идёт через современные сервера в Нидерландах, Москве и других локациях. 
Не собирается, не хранится и защищён сквозным шифрованием - спокойно вводи логины/пароли и отправляй личные файлы, они в безопасности
✈️ Скорость передачи серверов 10 Gb/сек, остальные ограничения наложены тарифом провайдера. 

В прикреплённых фото результат Speedtest-а: зелёный слайд - скорость скачивания, фиолетовый - загрузки

 Описание для отключения автоподписки на VPN:

 При покупке ключей с автоподпиской они появляются в разделе «Мои активные ключи».
 Рядом с каждым активным ключом с автоподпиской будет отображаться значок в виде крестика.
 Чтобы отключить автоподписку, просто нажмите на крестик рядом с нужным ключом.
 После нажатия автоподписка будет отключена, и ключ больше не будет автоматически продлеваться.
 Эти шаги позволят вам легко контролировать автоподписку для своих VPN-ключей.
 При покупке ключей с автоподпиской (в том числе с пробным периодом, за 1₽ или вручную) включается автосписание.
 После окончания пробного или оплаченного срока — подписка продлевается автоматически.
 Все такие ключи отображаются в разделе «Мои активные ключи».
 Чтобы отключить автосписание, нажмите ✖️ рядом с нужным ключом.

✅️Проверить скорость интернета на своем устройстве ты сможешь после подключения VPN
📍 Твой постоянный IP-адрес - даёт снижение риска блокировки аккаунтов из-за частой смены IP
'''

ios_links = [
        'https://apps.apple.com/ru/app/streisand/id6450534064',
        'https://apps.apple.com/ru/app/happ-proxy-utility-plus/id6746188973',
        'https://apps.apple.com/us/app/foxray/id6448898396',
        'https://apps.apple.com/us/app/v2box-v2ray-client/id6446814690'
    ]

android_links = [
    'https://github.com/MatsuriDayo/NekoBoxForAndroid/releases',
    'https://play.google.com/store/apps/details?id=io.nekohasekai.sfa&hl=ru',
    'https://github.com/2dust/v2rayNG'
]